In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
df = DataFrame

In [3]:
df = pd.read_csv(r"C:\Users\Sett's Wife\Desktop\Data Analysis\Certificates\IBM Data Analyst Professional Certificate edX\Course 9 Data Analytics and Visualization Capstone Project\Module 5 How to Present Your Findings\Data\New folder\Database.csv")

In [4]:
df

       Respondent DatabaseDesireNextYear    DatabaseWorkedWith
0              10   Microsoft SQL Server  Microsoft SQL Server
1              33                MongoDB               MongoDB
2              33                    NaN                 MySQL
3              33                    NaN            PostgreSQL
4              33                    NaN                SQLite
...           ...                    ...                   ...
24144       64938                    NaN            PostgreSQL
24145       64938                    NaN                 Redis
24146       64938                MongoDB                   NaN
24147       64938             PostgreSQL                   NaN
24148       64938                  Redis                   NaN

[24149 rows x 3 columns]

In [6]:
df.shape

(24149, 3)

In [7]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
24144    False
24145    False
24146    False
24147    False
24148    False
Length: 24149, dtype: bool

In [8]:
df = df.drop_duplicates()

In [9]:
df

       Respondent DatabaseDesireNextYear    DatabaseWorkedWith
0              10   Microsoft SQL Server  Microsoft SQL Server
1              33                MongoDB               MongoDB
2              33                    NaN                 MySQL
3              33                    NaN            PostgreSQL
4              33                    NaN                SQLite
...           ...                    ...                   ...
24144       64938                    NaN            PostgreSQL
24145       64938                    NaN                 Redis
24146       64938                MongoDB                   NaN
24147       64938             PostgreSQL                   NaN
24148       64938                  Redis                   NaN

[24149 rows x 3 columns]

In [11]:
import numpy as np

In [12]:
df.replace(np.nan, inplace = True)

Respondent                None
DatabaseDesireNextYear    None
DatabaseWorkedWith        None
dtype: object

In [13]:
df

       Respondent DatabaseDesireNextYear    DatabaseWorkedWith
0              10   Microsoft SQL Server  Microsoft SQL Server
1              33                MongoDB               MongoDB
2              33                MongoDB                 MySQL
3              33                MongoDB            PostgreSQL
4              33                MongoDB                SQLite
...           ...                    ...                   ...
24144       64938          Elasticsearch            PostgreSQL
24145       64938          Elasticsearch                 Redis
24146       64938                MongoDB                 Redis
24147       64938             PostgreSQL                 Redis
24148       64938                  Redis                 Redis

[24149 rows x 3 columns]

In [14]:
df.head()

   Respondent DatabaseDesireNextYear    DatabaseWorkedWith
0          10   Microsoft SQL Server  Microsoft SQL Server
1          33                MongoDB               MongoDB
2          33                MongoDB                 MySQL
3          33                MongoDB            PostgreSQL
4          33                MongoDB                SQLite

In [15]:
df.tail()

       Respondent DatabaseDesireNextYear DatabaseWorkedWith
24144       64938          Elasticsearch         PostgreSQL
24145       64938          Elasticsearch              Redis
24146       64938                MongoDB              Redis
24147       64938             PostgreSQL              Redis
24148       64938                  Redis              Redis

In [16]:
missing_data = df.isnull()

In [17]:
missing_data.head(5)

   Respondent  DatabaseDesireNextYear  DatabaseWorkedWith
0       False                   False               False
1       False                   False               False
2       False                   False               False
3       False                   False               False
4       False                   False               False

In [18]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

Respondent
False    24149
Name: Respondent, dtype: int64

DatabaseDesireNextYear
False    24149
Name: DatabaseDesireNextYear, dtype: int64

DatabaseWorkedWith
False    24149
Name: DatabaseWorkedWith, dtype: int64

In [19]:
df.duplicated().sum()

0

In [20]:
df.isnull().sum()

Respondent                0
DatabaseDesireNextYear    0
DatabaseWorkedWith        0
dtype: int64

In [21]:
df.dtypes

Respondent                 int64
DatabaseDesireNextYear    object
DatabaseWorkedWith        object
dtype: object

In [22]:
df.to_csv(r"C:\Users\Sett's Wife\Desktop\Data Analysis\Certificates\IBM Data Analyst Professional Certificate edX\Course 9 Data Analytics and Visualization Capstone Project\Module 5 How to Present Your Findings\Data\New folder\Data Wrangling\panel 2\Database 1.csv")

In [23]:
df["DatabaseDesireNextYear"].value_counts()

Elasticsearch           4051
PostgreSQL              2715
Microsoft SQL Server    2421
MongoDB                 2353
Cassandra               1987
DynamoDB                1975
Redis                   1902
Firebase                1801
MySQL                   1692
MariaDB                 1249
SQLite                  1037
Couchbase                515
Oracle                   339
IBM DB2                  112
Name: DatabaseDesireNextYear, dtype: int64